{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Knowledge Graphs Introduction.\n",
    "\n",
    "The [slides from NEO4j](https://www.slideshare.net/neo4j/knowledge-graphs-the-power-of-graphbased-search?from_action=save) are a good point to start.\n",
    "I strongly recommend you to explore these slides:\n",
    "* 3-7\n",
    "* 23-25\n",
    "* 32-34\n",
    "\n",
    "This [slides from Microsoft](https://kdd2018tutorialt39.azurewebsites.net/KDD%20Tutorial%20T39.pdf) are more academic but they pinpoint the actual research topics on the field.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Neo4j\n",
    "\n",
    "You *need* to set up Neo4j, follow the [README](readme.md) instructions."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from json import dumps\n",
    "import time\n",
    "from pandas import DataFrame\n",
    "from pandas import read_json\n",
    "import requests\n",
    "import jmespath"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "class KnowledgeRecommendation(object):\n",
    "\n",
    "    def __init__(self, uri, user, password):\n",
    "        self._driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "        self.session = self._driver.session()\n",
    "\n",
    "    def close(self):\n",
    "        self._driver.close()\n",
    "    \n",
    "    def serialize_movie(self,movie):\n",
    "        return {\n",
    "            'id': movie['id'],\n",
    "            'title': movie['title'],\n",
    "#             'summary': movie['description'],\n",
    "            'released': movie.get('releaseDate'),\n",
    "            'duration': movie['runtime'],\n",
    "            'rated': movie['rated'],\n",
    "            'imdbId': movie['imdbId'],\n",
    "            'genre': movie['genre']\n",
    "        }\n",
    "    \n",
    "    def movie(self,title):\n",
    "        query = ('MATCH (movie:Movie) ' +\n",
    "                 f'WHERE movie.title =~ \"{title}\" ' +\n",
    "                 'RETURN movie')\n",
    "        results = self.session.run(query)\n",
    "        return [self.serialize_movie(record['movie']) for record in results.data()]\n",
    "    \n",
    "    def same_genre_movies(self, title):\n",
    "        query = ('MATCH (movie:Movie) ' +\n",
    "                 f'WHERE movie.title = \"{title}\" '+\n",
    "                'WITH movie.genre as genre '+\n",
    "                'MATCH (movies:Movie) '+\n",
    "                'WHERE movies.genre = genre '+\n",
    "                'RETURN movies.title, movies.releaseDate, movies.genre, movies.imdbId '+\n",
    "                'LIMIT 100')\n",
    "        results = self.session.run(query)\n",
    "#         return [self.serialize_movie(record['movies']) for record in results.data()] # you should only return movies\n",
    "        return results.data()\n",
    "    \n",
    "    def movies_by_movie_director(self, title):\n",
    "        query = ('MATCH (movie:Movie)<-[:DIRECTED]-(director:Director) '+\n",
    "                f'WHERE movie.title = \"{title}\" '+\n",
    "                'MATCH (movies:Movie)<-[:DIRECTED]-(director) '+\n",
    "                'RETURN movies.title, movies.releaseDate, movies.genre, movies.imdbId '+\n",
    "                'LIMIT 100')\n",
    "        results = self.session.run(query)\n",
    "        return results.data()\n",
    "    \n",
    "    def movies_by_actor(self,actor):\n",
    "        query = ('MATCH (movies:Movie)<-[:ACTS_IN]-(actor:Actor) '+\n",
    "                f'WHERE actor.name = \"{actor}\" '+\n",
    "                'RETURN movies.title, movies.releaseDate, movies.genre, movies.imdbId ')\n",
    "        results = self.session.run(query)\n",
    "        return results.data()\n",
    "    \n",
    "    def movies_by_actor_and_genre(self,actor, genre):\n",
    "        query = ('MATCH (movies:Movie)<-[:ACTS_IN]-(actor:Actor) '+\n",
    "                f'WHERE actor.name = \"{actor}\" and movies.genre=\"{genre}\" '+\n",
    "                'RETURN movies.title, movies.releaseDate, movies.genre, movies.imdbId ')\n",
    "        results = self.session.run(query)\n",
    "        return results.data()\n",
    "    \n",
    "    def movies_shared_actors_with_genre(self,actor, genre):\n",
    "        query = ('MATCH (actor:Actor)-[:ACTS_IN]->(movie:Movie)<-[:ACTS_IN]-(actors:Actor) ' +\n",
    "            f'WHERE actor.name = \"{actor}\" ' +\n",
    "            'WITH actors ' +\n",
    "            'MATCH (actors)-[:ACTS_IN]->(movies:Movie) ' +\n",
    "           f'WHERE movies.genre=\"{genre}\" ' +\n",
    "            'RETURN movies.title, movies.releaseDate, movies.genre, movies.imdbId ' +\n",
    "            'LIMIT 100 ' )\n",
    "        print(query)\n",
    "        results = self.session.run(query)\n",
    "        return results.data()\n",
    "        \n",
    "    \n",
    "graph = KnowledgeRecommendation(\"bolt://localhost:11004\", \"neo4j\", \"123456\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'id': '329', 'title': 'Jurassic Park', 'released': '739749600000', 'duration': 127, 'rated': None, 'imdbId': 'tt0107290', 'genre': 'Action'}]\n"
     ]
    }
   ],
   "source": [
    "avatar = graph.movie(\"Jurassic Park\")\n",
    "print(avatar)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movies.genre</th>\n",
       "      <th>movies.imdbId</th>\n",
       "      <th>movies.releaseDate</th>\n",
       "      <th>movies.title</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0499549</td>\n",
       "      <td>1261090800000</td>\n",
       "      <td>Avatar</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0093058</td>\n",
       "      <td>551656800000</td>\n",
       "      <td>Full Metal Jacket</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0083866</td>\n",
       "      <td>391212000000</td>\n",
       "      <td>E.T.: The Extra-Terrestrial</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0116629</td>\n",
       "      <td>835653600000</td>\n",
       "      <td>Independence Day</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0133093</td>\n",
       "      <td>922831200000</td>\n",
       "      <td>The Matrix</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0234215</td>\n",
       "      <td>1052258400000</td>\n",
       "      <td>The Matrix Reloaded</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0242653</td>\n",
       "      <td>1067209200000</td>\n",
       "      <td>The Matrix Revolutions</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0119654</td>\n",
       "      <td>867708000000</td>\n",
       "      <td>Men In Black</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0120912</td>\n",
       "      <td>1025647200000</td>\n",
       "      <td>Men In Black II</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0109830</td>\n",
       "      <td>772322400000</td>\n",
       "      <td>Forrest Gump</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0076759</td>\n",
       "      <td>233362800000</td>\n",
       "      <td>Star Wars: Episode IV - A New Hope</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0120915</td>\n",
       "      <td>927064800000</td>\n",
       "      <td>Star Wars: Episode I - The Phantom Menace</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0086190</td>\n",
       "      <td>422661600000</td>\n",
       "      <td>Star Wars: Episode VI - Return of the Jedi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0121765</td>\n",
       "      <td>1021500000000</td>\n",
       "      <td>Star Wars: Episode II - Attack of the Clones</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0092007</td>\n",
       "      <td>533343600000</td>\n",
       "      <td>Star Trek IV: The Voyage Home</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0120844</td>\n",
       "      <td>913330800000</td>\n",
       "      <td>Star Trek: Insurrection</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0088170</td>\n",
       "      <td>454888800000</td>\n",
       "      <td>Star Trek III: The Search for Spock</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0079945</td>\n",
       "      <td>313369200000</td>\n",
       "      <td>Star Trek: The Motion Picture</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0253754</td>\n",
       "      <td>1039734000000</td>\n",
       "      <td>Star Trek: Nemesis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0084726</td>\n",
       "      <td>391989600000</td>\n",
       "      <td>Star Trek II: The Wrath of Khan</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt1014759</td>\n",
       "      <td>1267657200000</td>\n",
       "      <td>Alice in Wonderland</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0383574</td>\n",
       "      <td>1152223200000</td>\n",
       "      <td>Pirates of the Caribbean: Dead Man's Chest</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0449088</td>\n",
       "      <td>1179525600000</td>\n",
       "      <td>Pirates of the Caribbean: At World's End</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0367594</td>\n",
       "      <td>1121378400000</td>\n",
       "      <td>Charlie and the Chocolate Factory</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0325980</td>\n",
       "      <td>1057701600000</td>\n",
       "      <td>Pirates of the Caribbean: The Curse of the Bla...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0112384</td>\n",
       "      <td>803772000000</td>\n",
       "      <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0120737</td>\n",
       "      <td>1008716400000</td>\n",
       "      <td>The Lord of the Rings: The Fellowship of the Ring</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0167261</td>\n",
       "      <td>1040166000000</td>\n",
       "      <td>The Lord of the Rings: The Two Towers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0167260</td>\n",
       "      <td>1071615600000</td>\n",
       "      <td>The Lord of the Rings: The Return of the King</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0107286</td>\n",
       "      <td>750639600000</td>\n",
       "      <td>Judgment Night</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0109303</td>\n",
       "      <td>773013600000</td>\n",
       "      <td>Blown Away</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0181689</td>\n",
       "      <td>1024610400000</td>\n",
       "      <td>Minority Report</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0119396</td>\n",
       "      <td>883004400000</td>\n",
       "      <td>Jackie Brown</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0425210</td>\n",
       "      <td>1140735600000</td>\n",
       "      <td>Lucky Number Slevin</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0401792</td>\n",
       "      <td>1112306400000</td>\n",
       "      <td>Sin City</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>Action</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>Sin City</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0099088</td>\n",
       "      <td>643586400000</td>\n",
       "      <td>Back to the Future Part III</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0112573</td>\n",
       "      <td>801266400000</td>\n",
       "      <td>Braveheart</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0070379</td>\n",
       "      <td>118364400000</td>\n",
       "      <td>Mean Streets</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0053125</td>\n",
       "      <td>-329187600000</td>\n",
       "      <td>North by Northwest</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>80</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0367882</td>\n",
       "      <td>1211061600000</td>\n",
       "      <td>Indiana Jones and the Kingdom of the Crystal S...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0088247</td>\n",
       "      <td>467593200000</td>\n",
       "      <td>The Terminator</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>82</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0365737</td>\n",
       "      <td>1134082800000</td>\n",
       "      <td>Syriana</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0086216</td>\n",
       "      <td>434415600000</td>\n",
       "      <td>Rumble Fish</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0080117</td>\n",
       "      <td>300668400000</td>\n",
       "      <td>The Wanderers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0068646</td>\n",
       "      <td>69462000000</td>\n",
       "      <td>The Godfather</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0071562</td>\n",
       "      <td>156034800000</td>\n",
       "      <td>The Godfather: Part II</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0110632</td>\n",
       "      <td>777852000000</td>\n",
       "      <td>Natural Born Killers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0024216</td>\n",
       "      <td>-1162429200000</td>\n",
       "      <td>King Kong</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0363226</td>\n",
       "      <td>1062453600000</td>\n",
       "      <td>The Blind Swordsman: Zatoichi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0180748</td>\n",
       "      <td>936914400000</td>\n",
       "      <td>In China They Eat Dogs</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>91</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0070328</td>\n",
       "      <td>110674800000</td>\n",
       "      <td>Live and Let Die</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>92</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0360717</td>\n",
       "      <td>1134514800000</td>\n",
       "      <td>King Kong</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>93</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0096895</td>\n",
       "      <td>614556000000</td>\n",
       "      <td>Batman</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0372784</td>\n",
       "      <td>1118959200000</td>\n",
       "      <td>Batman Begins</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0320691</td>\n",
       "      <td>1063922400000</td>\n",
       "      <td>Underworld</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0103064</td>\n",
       "      <td>691455600000</td>\n",
       "      <td>Terminator 2: Judgment Day</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0044706</td>\n",
       "      <td>-550285200000</td>\n",
       "      <td>High Noon</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0181852</td>\n",
       "      <td>1057096800000</td>\n",
       "      <td>Terminator 3: Rise of the Machines</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>Action</td>\n",
       "      <td>tt0496806</td>\n",
       "      <td>1181253600000</td>\n",
       "      <td>Ocean's Thirteen</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>100 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   movies.genre movies.imdbId movies.releaseDate  \\\n",
       "0        Action     tt0499549      1261090800000   \n",
       "1        Action     tt0093058       551656800000   \n",
       "2        Action     tt0083866       391212000000   \n",
       "3        Action     tt0116629       835653600000   \n",
       "4        Action     tt0133093       922831200000   \n",
       "5        Action     tt0234215      1052258400000   \n",
       "6        Action     tt0242653      1067209200000   \n",
       "7        Action     tt0119654       867708000000   \n",
       "8        Action     tt0120912      1025647200000   \n",
       "9        Action     tt0109830       772322400000   \n",
       "10       Action     tt0076759       233362800000   \n",
       "11       Action     tt0120915       927064800000   \n",
       "12       Action     tt0086190       422661600000   \n",
       "13       Action     tt0121765      1021500000000   \n",
       "14       Action     tt0092007       533343600000   \n",
       "15       Action     tt0120844       913330800000   \n",
       "16       Action     tt0088170       454888800000   \n",
       "17       Action     tt0079945       313369200000   \n",
       "18       Action     tt0253754      1039734000000   \n",
       "19       Action     tt0084726       391989600000   \n",
       "20       Action     tt1014759      1267657200000   \n",
       "21       Action     tt0383574      1152223200000   \n",
       "22       Action     tt0449088      1179525600000   \n",
       "23       Action     tt0367594      1121378400000   \n",
       "24       Action     tt0325980      1057701600000   \n",
       "25       Action     tt0112384       803772000000   \n",
       "26       Action     tt0120737      1008716400000   \n",
       "27       Action     tt0167261      1040166000000   \n",
       "28       Action     tt0167260      1071615600000   \n",
       "29       Action     tt0107286       750639600000   \n",
       "..          ...           ...                ...   \n",
       "70       Action     tt0109303       773013600000   \n",
       "71       Action     tt0181689      1024610400000   \n",
       "72       Action     tt0119396       883004400000   \n",
       "73       Action     tt0425210      1140735600000   \n",
       "74       Action     tt0401792      1112306400000   \n",
       "75       Action          None               None   \n",
       "76       Action     tt0099088       643586400000   \n",
       "77       Action     tt0112573       801266400000   \n",
       "78       Action     tt0070379       118364400000   \n",
       "79       Action     tt0053125      -329187600000   \n",
       "80       Action     tt0367882      1211061600000   \n",
       "81       Action     tt0088247       467593200000   \n",
       "82       Action     tt0365737      1134082800000   \n",
       "83       Action     tt0086216       434415600000   \n",
       "84       Action     tt0080117       300668400000   \n",
       "85       Action     tt0068646        69462000000   \n",
       "86       Action     tt0071562       156034800000   \n",
       "87       Action     tt0110632       777852000000   \n",
       "88       Action     tt0024216     -1162429200000   \n",
       "89       Action     tt0363226      1062453600000   \n",
       "90       Action     tt0180748       936914400000   \n",
       "91       Action     tt0070328       110674800000   \n",
       "92       Action     tt0360717      1134514800000   \n",
       "93       Action     tt0096895       614556000000   \n",
       "94       Action     tt0372784      1118959200000   \n",
       "95       Action     tt0320691      1063922400000   \n",
       "96       Action     tt0103064       691455600000   \n",
       "97       Action     tt0044706      -550285200000   \n",
       "98       Action     tt0181852      1057096800000   \n",
       "99       Action     tt0496806      1181253600000   \n",
       "\n",
       "                                         movies.title  \n",
       "0                                              Avatar  \n",
       "1                                   Full Metal Jacket  \n",
       "2                         E.T.: The Extra-Terrestrial  \n",
       "3                                    Independence Day  \n",
       "4                                          The Matrix  \n",
       "5                                 The Matrix Reloaded  \n",
       "6                              The Matrix Revolutions  \n",
       "7                                        Men In Black  \n",
       "8                                     Men In Black II  \n",
       "9                                        Forrest Gump  \n",
       "10                 Star Wars: Episode IV - A New Hope  \n",
       "11          Star Wars: Episode I - The Phantom Menace  \n",
       "12         Star Wars: Episode VI - Return of the Jedi  \n",
       "13       Star Wars: Episode II - Attack of the Clones  \n",
       "14                      Star Trek IV: The Voyage Home  \n",
       "15                            Star Trek: Insurrection  \n",
       "16                Star Trek III: The Search for Spock  \n",
       "17                      Star Trek: The Motion Picture  \n",
       "18                                 Star Trek: Nemesis  \n",
       "19                    Star Trek II: The Wrath of Khan  \n",
       "20                                Alice in Wonderland  \n",
       "21         Pirates of the Caribbean: Dead Man's Chest  \n",
       "22           Pirates of the Caribbean: At World's End  \n",
       "23                  Charlie and the Chocolate Factory  \n",
       "24  Pirates of the Caribbean: The Curse of the Bla...  \n",
       "25                                          Apollo 13  \n",
       "26  The Lord of the Rings: The Fellowship of the Ring  \n",
       "27              The Lord of the Rings: The Two Towers  \n",
       "28      The Lord of the Rings: The Return of the King  \n",
       "29                                     Judgment Night  \n",
       "..                                                ...  \n",
       "70                                         Blown Away  \n",
       "71                                    Minority Report  \n",
       "72                                       Jackie Brown  \n",
       "73                                Lucky Number Slevin  \n",
       "74                                           Sin City  \n",
       "75                                           Sin City  \n",
       "76                        Back to the Future Part III  \n",
       "77                                         Braveheart  \n",
       "78                                       Mean Streets  \n",
       "79                                 North by Northwest  \n",
       "80  Indiana Jones and the Kingdom of the Crystal S...  \n",
       "81                                     The Terminator  \n",
       "82                                            Syriana  \n",
       "83                                        Rumble Fish  \n",
       "84                                      The Wanderers  \n",
       "85                                      The Godfather  \n",
       "86                             The Godfather: Part II  \n",
       "87                               Natural Born Killers  \n",
       "88                                          King Kong  \n",
       "89                      The Blind Swordsman: Zatoichi  \n",
       "90                             In China They Eat Dogs  \n",
       "91                                   Live and Let Die  \n",
       "92                                          King Kong  \n",
       "93                                             Batman  \n",
       "94                                      Batman Begins  \n",
       "95                                         Underworld  \n",
       "96                         Terminator 2: Judgment Day  \n",
       "97                                          High Noon  \n",
       "98                 Terminator 3: Rise of the Machines  \n",
       "99                                   Ocean's Thirteen  \n",
       "\n",
       "[100 rows x 4 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "other_movies = graph.same_genre_movies(\"Jurassic Park\")\n",
    "DataFrame(other_movies)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "movies_director = graph.movies_by_movie_director(\"Jurassic Park\")\n",
    "DataFrame(movies_director)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "actor = graph.movies_by_actor(\"Michael J. Fox\")\n",
    "DataFrame(actor)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "actor_and_genre = graph.movies_by_actor_and_genre(\"Michael J. Fox\", \"Action\")\n",
    "DataFrame(actor_and_genre)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'graph' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-6-efec509053c8>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m()\u001b[0m\n\u001b[1;32m----> 1\u001b[1;33m \u001b[0mmovies_other_actors_genre\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mgraph\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mmovies_shared_actors_with_genre\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"Michael J. Fox\"\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;34m\"Animation\"\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m      2\u001b[0m \u001b[0mDataFrame\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mmovies_other_actors_genre\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mNameError\u001b[0m: name 'graph' is not defined"
     ]
    }
   ],
   "source": [
    "movies_other_actors_genre = graph.movies_shared_actors_with_genre(\"Michael J. Fox\", \"Animation\")\n",
    "DataFrame(movies_other_actors_genre)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# SPARQL - WIKIDATA \n",
    "\n",
    "## Tutorials\n",
    "[Best tutorial ever](https://janakiev.com/blog/wikidata-mayors/)\n",
    "\n",
    "[Navegate the statements](https://en.wikibooks.org/wiki/SPARQL/WIKIDATA_Qualifiers,_References_and_Ranks)\n",
    "\n",
    "\n",
    "## Explore a movie\n",
    "Lets explore the [Jurassic Park](https://www.wikidata.org/wiki/Q167726) movie and see the information they show.\n",
    "\n",
    "[Wikipedia](https://en.wikipedia.org/wiki/Jurassic_Park_(film)) uses this info.\n",
    "\n",
    "\n",
    "### Useful attributes for movies\n",
    "Awardsrecieved https://www.wikidata.org/wiki/Property:P166\n",
    "\n",
    "main subject https://www.wikidata.org/wiki/Property:P921\n",
    "\n",
    "genre https://www.wikidata.org/wiki/Property:P136\n",
    "\n",
    "box office https://www.wikidata.org/wiki/Property:P2142"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# SPARQL exploration\n",
    "[Learning prefixes](https://www.mediawiki.org/wiki/Wikidata_Query_Service/User_Manual#Basics_-_Understanding_Prefixes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 129,
   "metadata": {},
   "outputs": [],
   "source": [
    "op = 3\n",
    "if op == 1:\n",
    "    query = \"\"\"SELECT ?movie ?movieLabel ?main_subjectLabel ?genreLabel ?box WHERE {\n",
    "      ?movie wdt:P345 \"tt0107290\";\n",
    "        wdt:P921 ?main_subject;\n",
    "        wdt:P136 ?genre.\n",
    "      ?movie p:P2142 ?statement.\n",
    "      ?statement ps:P2142 ?box\n",
    "      SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
    "    }\"\"\"\n",
    "elif op==2:\n",
    "    query = \"\"\"\n",
    "        SELECT \n",
    "          ?countryLabel ?population ?area ?medianIncome ?age\n",
    "        WHERE {\n",
    "          ?country wdt:P463 wd:Q458.\n",
    "          OPTIONAL { ?country wdt:P1082 ?population }\n",
    "          OPTIONAL { ?country wdt:P2046 ?area }\n",
    "          OPTIONAL { ?country wdt:P3529 ?medianIncome }\n",
    "          OPTIONAL { ?country wdt:P571 ?inception. \n",
    "            BIND(year(now()) - year(?inception) AS ?age)\n",
    "          }\n",
    "          SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
    "        }\"\"\"\n",
    "elif op == 3: #most box_office movies\n",
    "    query =  \"\"\" \n",
    "    SELECT DISTINCT ?movie ?movieLabel ?box WHERE {\n",
    "      SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
    "      ?movie wdt:P31 wd:Q11424;\n",
    "        p:P2142 ?statement;\n",
    "        p:P495 ?country_statement.\n",
    "      ?statement ps:P2142 ?box.\n",
    "      ?country_statement ps:P495 wd:Q30.\n",
    "      FILTER(?box >= 623933331 )\n",
    "    }\n",
    "    ORDER BY DESC (?box)\n",
    "    LIMIT 100\n",
    "    \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 130,
   "metadata": {},
   "outputs": [],
   "source": [
    "url = 'https://query.wikidata.org/sparql'\n",
    "\n",
    "r = requests.get(url, params = {'format': 'json', 'query': query})\n",
    "data = {}\n",
    "data = r.json()\n",
    "\n",
    "data = jmespath.search(\"values({headers:[head.vars], data:results.bindings | map(&values(@),@)[*][*].value})[]\", data)\n",
    "headers = data.pop(0)\n",
    "data = DataFrame(data, columns=headers)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 131,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movie</th>\n",
       "      <th>movieLabel</th>\n",
       "      <th>box</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q23781155</td>\n",
       "      <td>Avengers: Endgame</td>\n",
       "      <td>2677472736</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q44578</td>\n",
       "      <td>Titanic</td>\n",
       "      <td>2187463944</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q23780914</td>\n",
       "      <td>Avengers: Infinity War</td>\n",
       "      <td>2048359754</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.wikidata.org/entity/Q3512046</td>\n",
       "      <td>Jurassic World</td>\n",
       "      <td>1671713208</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.wikidata.org/entity/Q182218</td>\n",
       "      <td>The Avengers</td>\n",
       "      <td>1518812988</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://www.wikidata.org/entity/Q14650496</td>\n",
       "      <td>Furious 7</td>\n",
       "      <td>1516045911</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://www.wikidata.org/entity/Q14171368</td>\n",
       "      <td>Avengers: Age of Ultron</td>\n",
       "      <td>1405413868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://www.wikidata.org/entity/Q23780734</td>\n",
       "      <td>Black Panther</td>\n",
       "      <td>1346913161</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://www.wikidata.org/entity/Q232009</td>\n",
       "      <td>Harry Potter and the Deathly Hallows – Part 2</td>\n",
       "      <td>1341511219</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://www.wikidata.org/entity/Q18486021</td>\n",
       "      <td>Star Wars: The Last Jedi</td>\n",
       "      <td>1332539889</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://www.wikidata.org/entity/Q21877685</td>\n",
       "      <td>Jurassic World: Fallen Kingdom</td>\n",
       "      <td>1309500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>http://www.wikidata.org/entity/Q19829521</td>\n",
       "      <td>The Fate of the Furious</td>\n",
       "      <td>1236005118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>http://www.wikidata.org/entity/Q209538</td>\n",
       "      <td>Iron Man 3</td>\n",
       "      <td>1214811252</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>http://www.wikidata.org/entity/Q13619743</td>\n",
       "      <td>Minions</td>\n",
       "      <td>1159398397</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>http://www.wikidata.org/entity/Q18407657</td>\n",
       "      <td>Captain America: Civil War</td>\n",
       "      <td>1153304495</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>http://www.wikidata.org/entity/Q22998395</td>\n",
       "      <td>Aquaman</td>\n",
       "      <td>1147661807</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>http://www.wikidata.org/entity/Q232774</td>\n",
       "      <td>Transformers: Dark of the Moon</td>\n",
       "      <td>1123794079</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>http://www.wikidata.org/entity/Q131074</td>\n",
       "      <td>The Lord of the Rings: The Return of the King</td>\n",
       "      <td>1119929521</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>http://www.wikidata.org/entity/Q4941</td>\n",
       "      <td>Skyfall</td>\n",
       "      <td>1109000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>http://www.wikidata.org/entity/Q6151665</td>\n",
       "      <td>Transformers: Age of Extinction</td>\n",
       "      <td>1104054072</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>http://www.wikidata.org/entity/Q189330</td>\n",
       "      <td>The Dark Knight Rises</td>\n",
       "      <td>1084939099</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>http://www.wikidata.org/entity/Q19590955</td>\n",
       "      <td>Rogue One</td>\n",
       "      <td>1056000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>http://www.wikidata.org/entity/Q167726</td>\n",
       "      <td>Jurassic Park</td>\n",
       "      <td>1029528120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>http://www.wikidata.org/entity/Q80379</td>\n",
       "      <td>The Hobbit: An Unexpected Journey</td>\n",
       "      <td>1021103568</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>http://www.wikidata.org/entity/Q163872</td>\n",
       "      <td>The Dark Knight</td>\n",
       "      <td>1004558444</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>http://www.wikidata.org/entity/Q49883590</td>\n",
       "      <td>Captain Marvel</td>\n",
       "      <td>994256559</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>http://www.wikidata.org/entity/Q49883590</td>\n",
       "      <td>Captain Marvel</td>\n",
       "      <td>992428923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>http://www.wikidata.org/entity/Q206497</td>\n",
       "      <td>The Blind Side</td>\n",
       "      <td>975200000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>http://www.wikidata.org/entity/Q102438</td>\n",
       "      <td>Harry Potter and the Philosopher's Stone</td>\n",
       "      <td>975051288</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>http://www.wikidata.org/entity/Q20762680</td>\n",
       "      <td>Jumanji: Welcome to the Jungle</td>\n",
       "      <td>962119864</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>http://www.wikidata.org/entity/Q18604504</td>\n",
       "      <td>Suicide Squad</td>\n",
       "      <td>746800000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>http://www.wikidata.org/entity/Q189600</td>\n",
       "      <td>The Matrix Reloaded</td>\n",
       "      <td>742100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>http://www.wikidata.org/entity/Q2579784</td>\n",
       "      <td>Gravity</td>\n",
       "      <td>723192705</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1765358</td>\n",
       "      <td>Captain America: The Winter Soldier</td>\n",
       "      <td>714264267</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74</th>\n",
       "      <td>http://www.wikidata.org/entity/Q60506</td>\n",
       "      <td>The Twilight Saga: Breaking Dawn – Part 1</td>\n",
       "      <td>712200000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>http://www.wikidata.org/entity/Q11220194</td>\n",
       "      <td>Dawn of the Planet of the Apes</td>\n",
       "      <td>710600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>http://www.wikidata.org/entity/Q116928</td>\n",
       "      <td>The Twilight Saga: New Moon</td>\n",
       "      <td>709711008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>http://www.wikidata.org/entity/Q171453</td>\n",
       "      <td>Transformers</td>\n",
       "      <td>709709780</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>http://www.wikidata.org/entity/Q4254026</td>\n",
       "      <td>The Amazing Spider-Man 2</td>\n",
       "      <td>709000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>http://www.wikidata.org/entity/Q25136484</td>\n",
       "      <td>It</td>\n",
       "      <td>700381748</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>80</th>\n",
       "      <td>http://www.wikidata.org/entity/Q217010</td>\n",
       "      <td>The Twilight Saga: Eclipse</td>\n",
       "      <td>698500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81</th>\n",
       "      <td>http://www.wikidata.org/entity/Q628154</td>\n",
       "      <td>Mission: Impossible – Ghost Protocol</td>\n",
       "      <td>694713380</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>82</th>\n",
       "      <td>http://www.wikidata.org/entity/Q212965</td>\n",
       "      <td>The Hunger Games</td>\n",
       "      <td>694400000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83</th>\n",
       "      <td>http://www.wikidata.org/entity/Q17548046</td>\n",
       "      <td>Mission: Impossible – Rogue Nation</td>\n",
       "      <td>682714267</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>http://www.wikidata.org/entity/Q23780914</td>\n",
       "      <td>Avengers: Infinity War</td>\n",
       "      <td>678815482</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>http://www.wikidata.org/entity/Q134773</td>\n",
       "      <td>Forrest Gump</td>\n",
       "      <td>677945399</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>http://www.wikidata.org/entity/Q18406872</td>\n",
       "      <td>Doctor Strange</td>\n",
       "      <td>677718395</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>http://www.wikidata.org/entity/Q13417189</td>\n",
       "      <td>Interstellar</td>\n",
       "      <td>677463813</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>http://www.wikidata.org/entity/Q183063</td>\n",
       "      <td>The Sixth Sense</td>\n",
       "      <td>672806292</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>http://www.wikidata.org/entity/Q622769</td>\n",
       "      <td>Man of Steel</td>\n",
       "      <td>668045518</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>http://www.wikidata.org/entity/Q20501835</td>\n",
       "      <td>Justice League</td>\n",
       "      <td>657924295</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>91</th>\n",
       "      <td>http://www.wikidata.org/entity/Q10307713</td>\n",
       "      <td>The Hunger Games: Mockingjay – Part 2</td>\n",
       "      <td>653428261</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>92</th>\n",
       "      <td>http://www.wikidata.org/entity/Q18199331</td>\n",
       "      <td>Fantastic Beasts: The Crimes of Grindelwald</td>\n",
       "      <td>653400000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>93</th>\n",
       "      <td>http://www.wikidata.org/entity/Q181069</td>\n",
       "      <td>Star Wars Episode II: Attack of the Clones</td>\n",
       "      <td>649398328</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1201853</td>\n",
       "      <td>Thor: The Dark World</td>\n",
       "      <td>644571402</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>http://www.wikidata.org/entity/Q18547944</td>\n",
       "      <td>The Martian</td>\n",
       "      <td>630161890</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>http://www.wikidata.org/entity/Q401976</td>\n",
       "      <td>Fast Five</td>\n",
       "      <td>626100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>http://www.wikidata.org/entity/Q220376</td>\n",
       "      <td>Hancock</td>\n",
       "      <td>624386746</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>http://www.wikidata.org/entity/Q327713</td>\n",
       "      <td>Men in Black 3</td>\n",
       "      <td>624000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>http://www.wikidata.org/entity/Q205028</td>\n",
       "      <td>Iron Man 2</td>\n",
       "      <td>623933331</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>100 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       movie  \\\n",
       "0   http://www.wikidata.org/entity/Q23781155   \n",
       "1      http://www.wikidata.org/entity/Q44578   \n",
       "2   http://www.wikidata.org/entity/Q23780914   \n",
       "3    http://www.wikidata.org/entity/Q3512046   \n",
       "4     http://www.wikidata.org/entity/Q182218   \n",
       "5   http://www.wikidata.org/entity/Q14650496   \n",
       "6   http://www.wikidata.org/entity/Q14171368   \n",
       "7   http://www.wikidata.org/entity/Q23780734   \n",
       "8     http://www.wikidata.org/entity/Q232009   \n",
       "9   http://www.wikidata.org/entity/Q18486021   \n",
       "10  http://www.wikidata.org/entity/Q21877685   \n",
       "11  http://www.wikidata.org/entity/Q19829521   \n",
       "12    http://www.wikidata.org/entity/Q209538   \n",
       "13  http://www.wikidata.org/entity/Q13619743   \n",
       "14  http://www.wikidata.org/entity/Q18407657   \n",
       "15  http://www.wikidata.org/entity/Q22998395   \n",
       "16    http://www.wikidata.org/entity/Q232774   \n",
       "17    http://www.wikidata.org/entity/Q131074   \n",
       "18      http://www.wikidata.org/entity/Q4941   \n",
       "19   http://www.wikidata.org/entity/Q6151665   \n",
       "20    http://www.wikidata.org/entity/Q189330   \n",
       "21  http://www.wikidata.org/entity/Q19590955   \n",
       "22    http://www.wikidata.org/entity/Q167726   \n",
       "23     http://www.wikidata.org/entity/Q80379   \n",
       "24    http://www.wikidata.org/entity/Q163872   \n",
       "25  http://www.wikidata.org/entity/Q49883590   \n",
       "26  http://www.wikidata.org/entity/Q49883590   \n",
       "27    http://www.wikidata.org/entity/Q206497   \n",
       "28    http://www.wikidata.org/entity/Q102438   \n",
       "29  http://www.wikidata.org/entity/Q20762680   \n",
       "..                                       ...   \n",
       "70  http://www.wikidata.org/entity/Q18604504   \n",
       "71    http://www.wikidata.org/entity/Q189600   \n",
       "72   http://www.wikidata.org/entity/Q2579784   \n",
       "73   http://www.wikidata.org/entity/Q1765358   \n",
       "74     http://www.wikidata.org/entity/Q60506   \n",
       "75  http://www.wikidata.org/entity/Q11220194   \n",
       "76    http://www.wikidata.org/entity/Q116928   \n",
       "77    http://www.wikidata.org/entity/Q171453   \n",
       "78   http://www.wikidata.org/entity/Q4254026   \n",
       "79  http://www.wikidata.org/entity/Q25136484   \n",
       "80    http://www.wikidata.org/entity/Q217010   \n",
       "81    http://www.wikidata.org/entity/Q628154   \n",
       "82    http://www.wikidata.org/entity/Q212965   \n",
       "83  http://www.wikidata.org/entity/Q17548046   \n",
       "84  http://www.wikidata.org/entity/Q23780914   \n",
       "85    http://www.wikidata.org/entity/Q134773   \n",
       "86  http://www.wikidata.org/entity/Q18406872   \n",
       "87  http://www.wikidata.org/entity/Q13417189   \n",
       "88    http://www.wikidata.org/entity/Q183063   \n",
       "89    http://www.wikidata.org/entity/Q622769   \n",
       "90  http://www.wikidata.org/entity/Q20501835   \n",
       "91  http://www.wikidata.org/entity/Q10307713   \n",
       "92  http://www.wikidata.org/entity/Q18199331   \n",
       "93    http://www.wikidata.org/entity/Q181069   \n",
       "94   http://www.wikidata.org/entity/Q1201853   \n",
       "95  http://www.wikidata.org/entity/Q18547944   \n",
       "96    http://www.wikidata.org/entity/Q401976   \n",
       "97    http://www.wikidata.org/entity/Q220376   \n",
       "98    http://www.wikidata.org/entity/Q327713   \n",
       "99    http://www.wikidata.org/entity/Q205028   \n",
       "\n",
       "                                       movieLabel         box  \n",
       "0                               Avengers: Endgame  2677472736  \n",
       "1                                         Titanic  2187463944  \n",
       "2                          Avengers: Infinity War  2048359754  \n",
       "3                                  Jurassic World  1671713208  \n",
       "4                                    The Avengers  1518812988  \n",
       "5                                       Furious 7  1516045911  \n",
       "6                         Avengers: Age of Ultron  1405413868  \n",
       "7                                   Black Panther  1346913161  \n",
       "8   Harry Potter and the Deathly Hallows – Part 2  1341511219  \n",
       "9                        Star Wars: The Last Jedi  1332539889  \n",
       "10                 Jurassic World: Fallen Kingdom  1309500000  \n",
       "11                        The Fate of the Furious  1236005118  \n",
       "12                                     Iron Man 3  1214811252  \n",
       "13                                        Minions  1159398397  \n",
       "14                     Captain America: Civil War  1153304495  \n",
       "15                                        Aquaman  1147661807  \n",
       "16                 Transformers: Dark of the Moon  1123794079  \n",
       "17  The Lord of the Rings: The Return of the King  1119929521  \n",
       "18                                        Skyfall  1109000000  \n",
       "19                Transformers: Age of Extinction  1104054072  \n",
       "20                          The Dark Knight Rises  1084939099  \n",
       "21                                      Rogue One  1056000000  \n",
       "22                                  Jurassic Park  1029528120  \n",
       "23              The Hobbit: An Unexpected Journey  1021103568  \n",
       "24                                The Dark Knight  1004558444  \n",
       "25                                 Captain Marvel   994256559  \n",
       "26                                 Captain Marvel   992428923  \n",
       "27                                 The Blind Side   975200000  \n",
       "28       Harry Potter and the Philosopher's Stone   975051288  \n",
       "29                 Jumanji: Welcome to the Jungle   962119864  \n",
       "..                                            ...         ...  \n",
       "70                                  Suicide Squad   746800000  \n",
       "71                            The Matrix Reloaded   742100000  \n",
       "72                                        Gravity   723192705  \n",
       "73            Captain America: The Winter Soldier   714264267  \n",
       "74      The Twilight Saga: Breaking Dawn – Part 1   712200000  \n",
       "75                 Dawn of the Planet of the Apes   710600000  \n",
       "76                    The Twilight Saga: New Moon   709711008  \n",
       "77                                   Transformers   709709780  \n",
       "78                       The Amazing Spider-Man 2   709000000  \n",
       "79                                             It   700381748  \n",
       "80                     The Twilight Saga: Eclipse   698500000  \n",
       "81           Mission: Impossible – Ghost Protocol   694713380  \n",
       "82                               The Hunger Games   694400000  \n",
       "83             Mission: Impossible – Rogue Nation   682714267  \n",
       "84                         Avengers: Infinity War   678815482  \n",
       "85                                   Forrest Gump   677945399  \n",
       "86                                 Doctor Strange   677718395  \n",
       "87                                   Interstellar   677463813  \n",
       "88                                The Sixth Sense   672806292  \n",
       "89                                   Man of Steel   668045518  \n",
       "90                                 Justice League   657924295  \n",
       "91          The Hunger Games: Mockingjay – Part 2   653428261  \n",
       "92    Fantastic Beasts: The Crimes of Grindelwald   653400000  \n",
       "93     Star Wars Episode II: Attack of the Clones   649398328  \n",
       "94                           Thor: The Dark World   644571402  \n",
       "95                                    The Martian   630161890  \n",
       "96                                      Fast Five   626100000  \n",
       "97                                        Hancock   624386746  \n",
       "98                                 Men in Black 3   624000000  \n",
       "99                                     Iron Man 2   623933331  \n",
       "\n",
       "[100 rows x 3 columns]"
      ]
     },
     "execution_count": 131,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
